// - створити функцію, яка генерує масив рандомних числових цілих значень в діапазоні від 0 до 100.

function getRandom (){
    return Math.random()
}

console.log(getRandom(0,100))

// - Змінти попередню функцію, щоб діапазон можна було визначити через аргументи.

let randomNums = (min, max) =>{
    return Math.floor(Math.random() * (max - min + 1)) + min;
}

console.log(randomNums(0, 100))

// - створити (або згенерувати, за допомоги попередньої функції) масив рандомних цілих числових значень. Відсортувати його за допомоги sort

let nums = [1, 3, 10, 70, 9, 43]
nums.sort ((a,b) =>{
    return a-b;
})

console.log(nums);

// - створити (або згенерувати, за допомоги попередньої функції) масив рандомних цілих числових значень. відфільтрувати  його за допомоги filter, за лишивши тільки парні числа

let rNums = [1, 3, 10, 70, 9, 43]
let result = rNums.filter (elem => elem % 2 == 0);

console.log(result);

// - створити масив рандомних цілих числових значень (або згенерувати, за допомоги попередньої функції) . за допомоги map та колбеку перетворити всі об'єкти в масиві на срінгові.

let rNums1 = [1, 3, 10, 70, 9, 43]
let value = String
let newMap = rNums1.map (function (value){
    return rNums1.length
})

console.log(rNums1);


// - Створити функцію конструктор для об'єктів User з полями id, name, surname , email, phone
// створити пустий масив, наповнити його 10 об'єктами new User(....)
// Взяти масив цей  User[] та: Відфільтрувати , залишивши тільки об'єкти з парними id (filter) та Відсортувати його по id. по зростанню (sort)